黄骏/week04/TakeawayEvaluationClassification/test_results/ab_test_c10.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        uvicorn
Server Hostname:        localhost
Server Port:            8000

Document Path:          /api/v1/evaluation_classify/bert
Document Length:        21 bytes

Concurrency Level:      10
Time taken for tests:   0.088 seconds
Complete requests:      100
Failed requests:        0
Non-2xx responses:      100
Total transferred:      19300 bytes
Total body sent:        35000
HTML transferred:       2100 bytes
Requests per second:    1139.16 [#/sec] (mean)
Time per request:       8.778 [ms] (mean)
Time per request:       0.878 [ms] (mean, across all concurrent requests)
Transfer rate:          214.70 [Kbytes/sec] received
                        389.36 kb/s sent
                        604.07 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       0
Processing:     1    8   2.8      7      16
Waiting:        1    5   2.6      5      16
Total:          1    8   2.7      7      17

Percentage of the requests served within a certain time (ms)
  50%      7
  66%      8
  75%      8
  80%      8
  90%     12
  95%     15
  98%     17
  99%     17
 100%     17 (longest request)