黄骏/week04/TakeawayEvaluationClassification/test_results/ab_test_c100.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        uvicorn
Server Hostname:        localhost
Server Port:            8000

Document Path:          /api/v1/evaluation_classify/bert
Document Length:        21 bytes

Concurrency Level:      100
Time taken for tests:   0.078 seconds
Complete requests:      100
Failed requests:        0
Non-2xx responses:      100
Total transferred:      19300 bytes
Total body sent:        35000
HTML transferred:       2100 bytes
Requests per second:    1278.92 [#/sec] (mean)
Time per request:       78.191 [ms] (mean)
Time per request:       0.782 [ms] (mean, across all concurrent requests)
Transfer rate:          241.05 [Kbytes/sec] received
                        437.13 kb/s sent
                        678.18 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.3      2       2
Processing:     2   58  25.7     74      75
Waiting:        1   37  20.5     37      73
Total:          2   59  25.9     76      76
ERROR: The median and mean for the initial connection time are more than twice the standard
       deviation apart. These results are NOT reliable.

Percentage of the requests served within a certain time (ms)
  50%     76
  66%     76
  75%     76
  80%     76
  90%     76
  95%     76
  98%     76
  99%     76
 100%     76 (longest request)