黄骏/week04/TakeawayEvaluationClassification/test_results/ab_test_c5.txt
This is ApacheBench, Version 2.3 <$Revision: 1923142 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient).....done


Server Software:        uvicorn
Server Hostname:        localhost
Server Port:            8000

Document Path:          /api/v1/evaluation_classify/bert
Document Length:        21 bytes

Concurrency Level:      5
Time taken for tests:   0.074 seconds
Complete requests:      100
Failed requests:        0
Non-2xx responses:      100
Total transferred:      19300 bytes
Total body sent:        35000
HTML transferred:       2100 bytes
Requests per second:    1343.26 [#/sec] (mean)
Time per request:       3.722 [ms] (mean)
Time per request:       0.744 [ms] (mean, across all concurrent requests)
Transfer rate:          253.17 [Kbytes/sec] received
                        459.12 kb/s sent
                        712.29 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:     1    4   0.5      4       4
Waiting:        1    2   0.9      2       4
Total:          1    4   0.5      4       5

Percentage of the requests served within a certain time (ms)
  50%      4
  66%      4
  75%      4
  80%      4
  90%      4
  95%      4
  98%      5
  99%      5
 100%      5 (longest request)